xwal3/esp-collections/track-a-production/01-kv-cli/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# CLI
CONFIG_CLI_PROMPT="kv> "
CONFIG_CLI_UART_BAUD=115200

# KV Store
CONFIG_KV_MAX_KEYS=16
CONFIG_KV_MAX_KEY_LEN=32
CONFIG_KV_MAX_VALUE_LEN=64